#+TITLE: Chapter 1: Building Abstractions With Procedures
#+STARTUP: latexpreview
#+LATEX_HEADER: \usepackage{amsmath}

* Solution 1.1
The results are, in this order:
#+begin_export ascii
10
12
8
3
6
(no output)
(no output)
19
#f
4
16
6
16
#+end_export

Indeed, we can verify the results by evaluating this code block.

#+begin_src scheme :results output
  (let ((exprs '(10
                 (+ 5 3 4)
                 (- 9 1)
                 (/ 6 2)
                 (+ (* 2 4) (- 4 6))
                 (define a 3)
                 (define b (+ a 1))
                 (+ a b (* a b))
                 (= a b)
                 (if (and (> b a) (< b (* a b)))
                     b
                     a)
                 (cond ((= a 4) 6)
                       ((= b 4) (+ 6 7 a))
                       (else 25))
                 (+ 2 (if (> b a) b a))
                 (* (cond ((> a b) a)
                          ((< a b) b)
                          (else -1))
                    (+ a 1)))))
    (for-each (lambda (expr)
                (display (eval expr (interaction-environment)))
                (newline))
              exprs))
#+end_src

#+RESULTS:
#+begin_example
10
12
8
3
6
#<unspecified>
#<unspecified>
19
#f
4
16
6
16
#+end_example


* Solution 1.3
#+begin_src scheme :session 1-3
  (define (sum-of-squares-of-two-largest x y z)
    (cond ((and (<= x y) (<= x z))
	   (sum-of-squares y z))
	  ((and (<= y x) (<= y z))
	   (sum-of-squares x z))
	  ((and (<= z x) (<= z y))
	   (sum-of-squares x y))))

  (define (sum-of-squares x y)
    (+ (* x x) (* y y)))
#+end_src

#+RESULTS:
: #<unspecified>

To test it out, this should yield 41:
#+begin_src scheme :session 1-3
  (sum-of-squares-of-two-largest 5 3 4)
#+end_src

#+RESULTS:
: 41


* Exercise 1.6
Alyssa P. Hacker doesn't see why =if= needs to be provided as a
special form.  "Why can't I just define it as an ordinary procedure in
terms of =cond=?" she asks.  Alyssa's friend Eva Lu Ator claims this
can indeed be done, and she defines a new version of =if=:

#+begin_src scheme :session 1-6
  (define (new-if predicate
		  then-clause
		  else-clause)
    (cond (predicate then-clause)
	  (else else-clause)))
#+end_src

#+RESULTS:
: #<unspecified>

Eva demonstrates the program for Alyssa:

#+begin_src scheme :session 1-6
  (new-if (= 2 3) 0 5)
#+end_src

#+RESULTS:
: 5

#+begin_src scheme :session 1-6
  (new-if (= 1 1) 0 5)
#+end_src

#+RESULTS:
: 0

Delighted, Alyssa uses =new-if= to rewrite the square-root program:

#+begin_src scheme :session 1-6
  (define (sqrt-iter guess x)
    (new-if (good-enough? guess x)
	    guess
	    (sqrt-iter (improve guess x) x)))
#+end_src

What happens when Alyssa attempts to use this to compute square roots?
Explain.


* Solution 1.8
#+begin_src scheme :session 1-8
  (define (cbrt-iter guess x)
    (if (good-enough? guess x)
	guess
	(cbrt-iter (improve guess x) x)))

  (define (improve guess x)
    (/ (+ (/ x (* guess guess)) (* 2 guess)) 3))

  (define (good-enough? guess x)
    (< (abs (- (cube guess) x)) 0.001))

  (define (cube x)
    (* x x x))

  (define (cbrt x)
    (cbrt-iter 1.0 x))
#+end_src

#+RESULTS:
: #<unspecified>

We can test this out by calculating the cube-root of $18$ (whose actual
value is approximately $2.62074139421$):

#+begin_src scheme :session 1-8
  (cbrt 18)
#+end_src

#+RESULTS:
: 2.620761740237634


* Solution 1.12

#+begin_src scheme :session
  (define (pascal row column)
    (cond ((= column 1) 1)
          ((= column row) 1)
          (else (+ (pascal (1- row) (1- column))
                   (pascal (1- row) column)))))
#+end_src

#+RESULTS:
: #<unspecified>

We can display a Pascal triangle of n rows like so:

#+begin_src scheme :session
  (define (pascal-row row)
    (map (lambda (col) (pascal row col)) (iota row 1)))

  (define (pascal-triangle n)
    (map pascal-row (iota n 1)))

  (pascal-triangle 10)
#+end_src

#+RESULTS:
| 1 |   |    |    |     |     |    |    |   |   |
| 1 | 1 |    |    |     |     |    |    |   |   |
| 1 | 2 |  1 |    |     |     |    |    |   |   |
| 1 | 3 |  3 |  1 |     |     |    |    |   |   |
| 1 | 4 |  6 |  4 |   1 |     |    |    |   |   |
| 1 | 5 | 10 | 10 |   5 |   1 |    |    |   |   |
| 1 | 6 | 15 | 20 |  15 |   6 |  1 |    |   |   |
| 1 | 7 | 21 | 35 |  35 |  21 |  7 |  1 |   |   |
| 1 | 8 | 28 | 56 |  70 |  56 | 28 |  8 | 1 |   |
| 1 | 9 | 36 | 84 | 126 | 126 | 84 | 36 | 9 | 1 |


